<template>
    <div>
      <div class="text-center d-flex pb-4">
        <v-btn class="ma-2" @click="all">
          All
        </v-btn>
        <v-btn class="ma-2" @click="none">
          None
        </v-btn>
      </div>
  
  
      <v-expansion-panels
        v-model="panel"
        multiple
      >
        <v-expansion-panel
          title="ปี1"
          text="

การเขียนโปรแกรมเบื้องต้น
3 หน่วยกิต

/เทคโนโลยีสารสนเทศและการสื่อสาร
3 หน่วยกิต

/เกษตรเพื่อชีวิต
3 หน่วยกิต

/ภาษาไทยเพื่อการนำเสนอ
3 หน่วยกิต

/ภาษาอังกฤษในชีวิตประจำวัน
3 หน่วยกิต

/แคลคูลัสสำหรับวิทยาศาสตร์และเทคโนโลยี
3 หน่วยกิต
/องค์ประกอบและสถาปัตยกรรมคอมพิวเตอร์
3 หน่วยกิต

/

เครือข่ายคอมพิวเตอร์เบื้องต้น
3 หน่วยกิต

/

การเขียนโปรแกรมและทักษะการแก้ปัญหา
3 หน่วยกิต

/คณิตศาสตร์ดีสครีต
3 หน่วยกิต

/

พลเมืองดิจิทัล
3 หน่วยกิต

/สนทนาภาษาอังกฤษ
3 หน่วยกิต"
          value="ปี1"
        ></v-expansion-panel>
  
        <v-expansion-panel
          title="ปี2"
          text="/

โครงสร้างข้อมูลและอัลกอริทึม
3 หน่วยกิต/

ฐานข้อมูลโครงสร้างเชิงสัมพันธ์
3 หน่วยกิต/

เว็บเทคโนโลยี
3 หน่วยกิต/

วิศวรกรรมซอฟต์แวร์
3 หน่วยกิต/

คณิตศาสตร์สำหรับวิทยาการคอมพิวเตอร์
3 หน่วยกิต/

ภาษาอังกฤษเชิงวิทยาศาสตร์และนวัตกรรม
3 หน่วยกิต/
การวิเคราะห์และออกแบบเชิงวัตถุ
3 หน่วยกิต/

ฐานข้อมูลแบบไม่มีโครงสร้าง
3 หน่วยกิต/
การพัฒนาระบบฝั่งเซิร์ฟเวอร์
3 หน่วยกิต/

การพัฒนาซอฟต์แวร์บนอุปกรณ์เคลื่อนที่
3 หน่วยกิต/

ความน่าจะเป็นและสถิติ
3 หน่วยกิต/

มนุษย์ สังคม เทคโนโลยีและสิ่งแวดล้อม
3หน่วยกิต"
          value="ปี2"
        ></v-expansion-panel>
  
        <v-expansion-panel
          title="ปี3"
          text="ภาษาอังกฤษเพื่อการศึกษาต่อและการประกอบอาชีพ
3 หน่วยกิต/

วิทยาศาสตร์เพื่อชีวิต
3 หน่วยกิต/
วิชาเอกเลือก วิชาที่ 1
3 หน่วยกิต/

วิชาเอกเลือก วิชาที่ 2
3 หน่วยกิต/

วิชาเอกเลือก วิชาที่ 3
3หน่วยกิต/

วิชาเอกเลือก วิชาที่ 4
3 หน่วยกิต/
ความฉลาดรู้ด้านวิทยาศาสตร์สำหรับโลกสมัยใหม่
3 หน่วยกิต/

การเป็นผู้ประกอบการ
3 หน่วยกิต/

วิชาเอกเลือก วิชาที่ 5
3 หน่วยกิต/
วิชาเอกเลือก วิชาที่ 6
3 หน่วยกิต/

วิชาเอกเลือก วิชาที่ 7
3 หน่วยกิต"
          value="ปี3"
        ></v-expansion-panel>

        <v-expansion-panel
          title="ปี4"
          text="สหกิจศึกษา (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)

10300498

การเรียนรู้อิสระ (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)

10300499

การศึกษา / ฝึกงาน / ฝึกอบรมต่างประเทศ (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)
สหกิจศึกษา (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)

10300498

การเรียนรู้อิสระ (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)

10300499

การศึกษา / ฝึกงาน / ฝึกอบรมต่างประเทศ (*เลือกอย่างใดอย่างหนึ่ง)
6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)"
          value="ปี4"
        ></v-expansion-panel>
      </v-expansion-panels>
    </div>
  </template>


  <script>
  export default {
    data () {
      return {
        panel: [],
      }
    },
    methods: {
      all () {
        this.panel = ['ปี1', 'ปี2', 'ปี3','ปี4' ]
      },
      none () {
        this.panel = []
      },
    },
  }
</script>